cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# Core system utils
brew 'ack'
brew 'coreutils'
brew 'htop'
brew 'openssl'
brew 'readline'
brew 'tmux'
brew 'wget'

# Language tools
brew 'python3'
brew 'go'
# C/Cpp
brew 'cmake'
brew 'clang-format'
brew 'folly'
# Ruby
brew 'ruby-build'
brew 'rbenv'
# JS
brew 'node'
brew 'yarn'
# Database
brew 'mongodb'
brew 'postgresql'
brew 'mysql'
brew 'redis'
brew 'sqlite'
# Libraries
brew 'opencv'
brew 'eigen'
# Other frameworks and tools
brew 'sshfs'
brew 'imagemagick'
brew 'hub'

# Applications, from cask
# cask 'atom'
# cask 'firefox'
# cask 'google-chrome'
# cask 'slack'
# cask 'vlc'
# cask 'visual-studio-code'
# cask 'iterm2'
# cask 'postman'
# cask 'alfred'
# cask 'docker'
